Revit 2027 API
MEPAnalyticalSegment.Comments Property
 The comments for this analytical segment.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Comments { get; }
Public ReadOnly Property Comments As String
	Get
public:
property String^ Comments {
	String^ get ();
}
member Comments : string with get
Property Value
String
See Also
Reference
MEPAnalyticalSegment Class
Autodesk.Revit.DB.Analysis Namespace